of-6/OpenFOAM-6-master/tutorials/lagrangian/reactingParcelFoam/filter/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

# copy 0.orig to 0
cp -r 0.orig 0

# create mesh
runApplication blockMesh

# create sets
runApplication topoSet

# create baffles and fields
runApplication createBaffles -overwrite

runApplication $application

#------------------------------------------------------------------------------
